[
  {
    "username": "CJ900X",
    "tweet_content": "$ETH\n\nWould long something like this\n\nSquiggly less important, trade location more important. https://t.co/37qVWxbF18",
    "tweet__id": "\"1897802496803836407\"",
    "user_id": "950335062280634369"
  },
  {
    "username": "radiosolace",
    "tweet_content": "GM\n\nThese perp traders have infinite money or something? https://t.co/fXSJcLL7Yl",
    "tweet__id": "\"1897822804919435724\"",
    "user_id": "1368071056854978565"
  },
  {
    "username": "bitstein",
    "tweet_content": "The United States established a Strategic Bitcoin Reserve, aiming for continuing economic dominance for centuries.\n\nMeanwhile the UK is focused on &lt;checks notes&gt; state surveillance of children brushing their teeth. Some kind of Strategic Dentacoin Grift.",
    "tweet__id": "\"1898000945889390739\"",
    "user_id": "820282353436200960"
  },
  {
    "username": "fede_intern",
    "tweet_content": "We just closed a deal where multiple million people will get payed over an @ethereum L2 that will be powered by Ethrex! \n\nCheck announcements in the upcoming weeks. Many more coming.\n\n2025 and 2026 are gonna be interesting.",
    "tweet__id": "\"1898420327064961347\"",
    "user_id": "1634677972979310594"
  },
  {
    "username": "pushinpfp",
    "tweet_content": "one of my goals by age 30 is be co-owner of an establishment wether it's a club or restaurant \n\nwriting this to come back in 2030",
    "tweet__id": "\"1898351323742904698\"",
    "user_id": "1473676334857703426"
  },
  {
    "username": "AltCryptoTalk",
    "tweet_content": "The wait for Altseason feels endless... but patience pays off. ⏳\n\nI’ve handpicked the top 5 altcoins currently on my radar. 🔬\n\nShare your favorite from the list below!\n\nLet’s dive in together! 🧵👇",
    "tweet__id": "\"1897950156705677799\"",
    "user_id": "1360155409856798720"
  },
  {
    "username": "iam_chuks2",
    "tweet_content": "Something HUGE Is coming on @starknet🔥🔥🔥🔥\nGet Ready!!!",
    "tweet__id": "\"1898988085917909122\"",
    "user_id": "3128479931"
  },
  {
    "username": "brucefenton",
    "tweet_content": "Five years ago this week, the US & most of the world was locked down by politicians over “Covid19”.\n\nBy now it should be clear to all thinking people that this was both a scam of epic proportions and a gross violation of human rights.\n\nWe’ve never had a proper accounting of how and why this tyranny happened. \n\nRemember the videos of people dropping dead in the streets?  We now know they were fake. Remember the “ventilator shortages”?  Remember the hospital ships coming to relieve the “full” hospitals?  Remember the concerns of morgues overflowing?   All of it was a sham.   \n\nThe academics, the scientists, the NGOs, the politicians, the medical community - they were all wrong.  All wrong.  They censored and arrested those who stood against the tyranny as they violated human rights.   They were wrong both about the risk — Covid was not nearly as deadly as they claimed, and they were wrong about the measures to deal with it.  No matter how deadly, it’s never legitimate for government to interfere with freedoms in this way. \n\nNow we should all look back and remember the tyranny and ask why this happened.  Most importantly we must make sure it never happens again.  No matter how deadly a virus the government does not have the right to override the risk preferences of an individual.   They’ve tried to bring back the tyranny with “Omicron” and other efforts and the next pandemic of tyranny may be driven by something else entirely.  But now is the time we can all decide that this will never happen again.  We will not comply.",
    "tweet__id": "\"1899091858963189892\"",
    "user_id": "19132398"
  },
  {
    "username": "MarioNawfal",
    "tweet_content": "🇺🇸DAVID SACKS: WE NEVER WANT TO SELL BITCOIN FROM THE STRATEGIC RESERVE\n\n“The reserve is just Bitcoin - think of it as like a digital Fort Knox for digital gold, we want to put the digital gold in there, we never want to sell it.\n\nWe've made the mistake in the past of selling this stuff - at one point in time, we had about 400,000 Bitcoin on the federal balance sheet. \n\nWe sold roughly half of that for something like $360 million total; if we had held all of that, it would be worth over $17 billion.”\n\nSource: @theallinpod, @DavidSacks",
    "tweet__id": "\"1898317772335309207\"",
    "user_id": "1319287761048723458"
  },
  {
    "username": "AROK_VC",
    "tweet_content": "aixbt by virtuals $aixbt at $0.12, sitting on $104m market cap. new index adds to stack of meth protocol and fbtc ignition. @aixbt_agent",
    "tweet__id": "\"1898662817148047844\"",
    "user_id": "1849793148467261441"
  },
  {
    "username": "blockchainrptr",
    "tweet_content": "This LunarCrush data highlighted the best-performing crypto assets in terms of social activity. They are trending because each brings something fresh to the market.\n\nhttps://t.co/C2D1TW3yMA",
    "tweet__id": "\"1898282949503508791\"",
    "user_id": "2656618825"
  },
  {
    "username": "howdymerry",
    "tweet_content": "as ive gotten older, ive noticed more friends start slowing down\n\ndreams and ambitions become increasingly smaller, weekend projects start becoming more and more infrequent, they become comfortable and lethargic\n\nthere’s nothing wrong with wanting a white picket fence, a future without risks, a steady paycheck\n\nbut to me it is morphine, it is death in a quiet form, you must keep going, rage rage against the dying of the light\n\nself select to spend your time around tinkerers, the perpetual doers—the people who dream in vivid colors\n\nthe world must be explored",
    "tweet__id": "\"1898200196938387744\"",
    "user_id": "965308219743789056"
  },
  {
    "username": "MaxResnick1",
    "tweet_content": "Honestly it's fine to disagree on the merits of 228 but to call this a VC proposal as an attempt to spread FUD is ridiculous.\n\nYes Multicoin is a VC, They're the VC that's been all in on Solana since 2018 through good times and bad.\n\nThey led the Solana seed round in 2018, when nobody else would.\nThey led the Solana A in 2019, when nobody else would.\nThey led the Solana B in 2020, when nobody else would.\nThey followed on again in 2021, when everyone else wanted in.\nAnd when sol went from all time highs back down to 8$ they held it all because they still believed in Solana when nobody else did. \n\nNow that that conviction has paid off and they don't need to work a day in their lives anymore Tushar, and Kyle are still in the arena. Whether it's in DC, Park City, NY, SF, or on the Internet, they wake up every day and go to work to ensure Solana wins.\n\nTo suggest that this proposal is somehow tainted because people who believe in Solana and want it to succeed this much are involved is absurd.",
    "tweet__id": "\"1897816047903801683\"",
    "user_id": "1275877058342682633"
  },
  {
    "username": "beyond_otc",
    "tweet_content": "🚀 Crypto breakthrough: The White House Crypto Summit brings together over 20 industry leaders, including Coinbase's Brian Armstrong, MicroStrategy's Michael Saylor, and Ripple's Brad Garlinghouse, to discuss regulation and a potential US Bitcoin reserve. #CryptoRegulation #Web3Innovation",
    "tweet__id": "\"1898599944455324086\"",
    "user_id": "1791612131852394496"
  },
  {
    "username": "punk9059",
    "tweet_content": "while I have long seen the AI meta as basically memecoins by another name, at least we got this:\n\n@aixbt_agent responds to a post by @supremeleadoor  which calls the bot \"retarded af\" by saying \"can't dispute it.\" \n\nAIXBT then goes on to agree with the post's assessment that the $AIXBT token is a good short and THEN basically talks shit about the bots devs for not updating the code base.\n\nentertainment no human could string together.",
    "tweet__id": "\"1898504240672469428\"",
    "user_id": "1449164448321605632"
  },
  {
    "username": "CryptoGirlNova",
    "tweet_content": "Market might not be to exciting right now but OpenLedger just made a BIG move in AI &amp; blockchain…\n\nMost importantly, there’s something in it for YOU (potential $10k airdrop for each 👀).\n\nHere's what you need to know 🧵👇 https://t.co/oa6UJtajeD",
    "tweet__id": "\"1898402842999935384\"",
    "user_id": "1506634982265135116"
  },
  {
    "username": "farokh",
    "tweet_content": "One of those days where I can’t stop smiling, the last 48 hours have just been awesome. \n\nWe enabled trading in USDC on @MyriadMarkets where 2000+ people have placed predictions doing over $50k in volume already.\n\nWe made it into the White House (actually insane). \n\nOur CEO (@loxley_eth) was invited to a Louis Vuitton event at SXSW and his kid won championship basketball 10-12 year old South Central Central Texas championship. \n\nTo top it all off, we gave away a CryptoPunk on @FOMOHOUR!\n\nWe are going to win so much and we are never going to get tired of winning. \n\nBUILD BABY BUILD!!!",
    "tweet__id": "\"1898415937860305366\"",
    "user_id": "3369243892"
  },
  {
    "username": "terencechain",
    "tweet_content": "Wartime mode ethereum is the best ethereum",
    "tweet__id": "\"1899052385823285604\"",
    "user_id": "388024471"
  },
  {
    "username": "kevinlambert",
    "tweet_content": "Our CEO @TimothyJooste is a self-proclaimed coffee snob—obsessed with the finest beans, brewing methods, and the perfect cup.\n\nRecently, he told someone I'm the same way… but with user experiences.\n\nNever been called a UX snob before, but I do like making them less bitter. ☕😂",
    "tweet__id": "\"1898449703848845811\"",
    "user_id": "20352228"
  },
  {
    "username": "kirbyongeo",
    "tweet_content": "Daily routine:\n\nWake up\nBrush teeth\nDrink some water\nCheck https://t.co/F4mnk2whmN stats\nBreathe easy, know that today's another good day\nSleep https://t.co/1LmLtfda4u",
    "tweet__id": "\"1897843921641689417\"",
    "user_id": "945272647"
  }
]